In [2]:
import pandas as pd
import numpy as np
from numpy import nan as NA

In [3]:
st=pd.Series([1,3,4,2,NA])
#st[st.isnull()]
#st[st.notnull()]
st

0    1.0
1    3.0
2    4.0
3    2.0
4    NaN
dtype: float64

In [4]:
st.dropna()

0    1.0
1    3.0
2    4.0
3    2.0
dtype: float64

In [5]:
fm=pd.DataFrame([[NA,2,3,1],[1,NA,31,1],[1,2,3,NA]])
display(fm)#fm.dropna(how='all')

     0    1   2    3
0  NaN  2.0   3  1.0
1  1.0  NaN  31  1.0
2  1.0  2.0   3  NaN

In [6]:
fm.dropna(axis=1)

    2
0   3
1  31
2   3

In [28]:
df=pd.DataFrame(abs(np.random.randn(7,3)))
df

          0         1         2
0  0.946541  1.539350  0.347178
1  0.675507  0.287064  0.080554
2  0.789763  0.135104  0.439642
3  1.204075  0.790409  1.030411
4  0.380435  0.163963  0.655338
5  0.791610  0.810932  0.109577
6  1.443997  0.402121  0.126606

In [38]:
df.iloc[:4,2]=NA
df.iloc[0:1,0:2]=NA
df

          0         1         2
0       NaN       NaN       NaN
1  0.675507  0.287064       NaN
2  0.789763  0.135104       NaN
3  1.204075  0.790409       NaN
4  0.380435  0.163963  0.655338
5  0.791610  0.810932  0.109577
6  1.443997  0.402121  0.126606

In [67]:
df.dropna(thresh=4,axis=1)#

          0         1
0       NaN       NaN
1  0.675507  0.287064
2  0.789763  0.135104
3  1.204075  0.790409
4  0.380435  0.163963
5  0.791610  0.810932
6  1.443997  0.402121

In [52]:
df.dropna(thresh=3,axis=1)

          0         1
0       NaN       NaN
1  0.675507  0.287064
2  0.789763  0.135104
3  1.204075  0.790409
4  0.380435  0.163963
5  0.791610  0.810932
6  1.443997  0.402121

In [64]:
df.dropna(thresh=2,axis=0)

          0         1         2
1  0.675507  0.287064       NaN
2  0.789763  0.135104       NaN
3  1.204075  0.790409       NaN
4  0.380435  0.163963  0.655338
5  0.791610  0.810932  0.109577
6  1.443997  0.402121  0.126606

In [72]:
dd=pd.DataFrame(abs(np.random.randn(6,3)))
dd

          0         1         2
0  0.111064  0.348525  0.487168
1  1.153635  1.814132  1.071139
2  0.246447  1.632622  0.159409
3  0.032849  0.218117  0.312892
4  0.019583  1.708550  0.619386
5  0.136318  1.444185  0.260276

In [73]:
dd.iloc[0:2,1]=NA
dd.iloc[5,:2]=NA
dd

          0         1         2
0  0.111064       NaN  0.487168
1  1.153635       NaN  1.071139
2  0.246447  1.632622  0.159409
3  0.032849  0.218117  0.312892
4  0.019583  1.708550  0.619386
5       NaN       NaN  0.260276

In [78]:
dd.dropna(thresh=4,axis=1)

          0         2
0  0.111064  0.487168
1  1.153635  1.071139
2  0.246447  0.159409
3  0.032849  0.312892
4  0.019583  0.619386
5       NaN  0.260276

In [79]:
dd.dropna(thresh=3,axis=1)

          0         1         2
0  0.111064       NaN  0.487168
1  1.153635       NaN  1.071139
2  0.246447  1.632622  0.159409
3  0.032849  0.218117  0.312892
4  0.019583  1.708550  0.619386
5       NaN       NaN  0.260276

In [105]:
#dd.fillna(0.9,inplace=True)
#dd.fillna({1:88,0:111})
#dd.replace(NA,420)#also works on non-NA values
dd

          0         1         2
0  0.111064  0.900000  0.487168
1  1.153635  0.900000  1.071139
2  0.246447  1.632622  0.159409
3  0.032849  0.218117  0.312892
4  0.019583  1.708550  0.619386
5  0.900000  0.900000  0.260276

In [3]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [4]:
data[data.duplicated()]

    k1  k2
6  two   4

In [5]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [6]:
data['v1']=np.arange(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [12]:
display(data.drop_duplicates(['k2'],keep='last'))
display(data.drop_duplicates())
data.drop_duplicates(['k2'])

    k1  k2  v1
1  two   1   1
2  one   2   2
4  one   3   4
6  two   4   6

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

In [116]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon',
'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [118]:
lowercast=data['food'].str.lower()
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [119]:
data['animal']=lowercast.map(meat_to_animal)

In [120]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [38]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=['Ohiooereero', 'Coloradissiso', 'NewYorkpdrnrf'],columns=['one', 'two', 'three', 'four'])

In [39]:
transform=lambda x:x[:7].upper()
data.index.map(transform)
data.index=data.index.map(transform)
data

         one  two  three  four
OHIOOER    0    1      2     3
COLORAD    4    5      6     7
NEWYORK    8    9     10    11

In [163]:
data.rename(index={'COLO':'POLO'},columns=str.upper)

      ONE  TWO  THREE  FOUR
OHIO    0    1      2     3
POLO    4    5      6     7
NEW     8    9     10    11

In [185]:
ages = [20, 22, 25,26, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins=[18, 25, 35, 60, 100]# 18 to 25, 26 to 35, 36 to 60, and finally 61 and older
cats=pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (25, 35], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 13
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [187]:
cats=pd.cut(ages,bins,labels=['Youth', 'YoungAdult', 'MiddleAged', 'Senior'])
cats

[Youth, Youth, Youth, YoungAdult, YoungAdult, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 13
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [181]:
cats.codes

array([0, 0, 0, 1, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [182]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     4
(35, 60]     3
(60, 100]    1
dtype: int64

In [197]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.28, 0.51], (0.74, 0.97], (0.74, 0.97], (0.51, 0.74], (0.28, 0.51], ..., (0.51, 0.74], (0.048, 0.28], (0.51, 0.74], (0.048, 0.28], (0.74, 0.97]]
Length: 20
Categories (4, interval[float64]): [(0.048, 0.28] < (0.28, 0.51] < (0.51, 0.74] < (0.74, 0.97]]

# OUTLIERS

In [228]:
od=pd.DataFrame(np.random.randn(1000,4))
od.head()

          0         1         2         3
0  0.393383 -0.078145  0.634393 -1.254445
1  1.546597 -0.520027  0.628595  0.305722
2  0.210429 -0.509168 -1.856899 -0.945260
3 -0.507734  0.419157 -1.020941  0.608997
4 -1.313529  0.904552  0.726633  1.270763

In [233]:
#od[od>2]
od[np.abs(od)>1]=np.sign(od)*1
od.head()

          0         1         2         3
0  0.393383 -0.078145  0.634393 -1.000000
1  1.000000 -0.520027  0.628595  0.305722
2  0.210429 -0.509168 -1.000000 -0.945260
3 -0.507734  0.419157 -1.000000  0.608997
4 -1.000000  0.904552  0.726633  1.000000

In [235]:
#np.sign(od)

In [246]:
per=pd.DataFrame(np.arange(5*4).reshape(5,4))
sampler=abs(np.random.permutation(5))
per

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [247]:
sampler

array([1, 4, 3, 0, 2])

In [248]:
per.take(sampler)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
3  12  13  14  15
0   0   1   2   3
2   8   9  10  11

In [249]:
per.sample(n=3)

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
2   8   9  10  11

In [251]:
a=pd.Series([1,2,5,3,8,7])
a.sample(n=10,replace=True)

5    7
3    3
0    1
0    1
0    1
1    2
0    1
3    3
2    5
2    5
dtype: int64

In [252]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [256]:
pd.get_dummies(df)

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [259]:
pd.get_dummies(df['key'],prefix='pre')

   pre_a  pre_b  pre_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [53]:
# mnames = ['ser_no','movie_id', 'title', 'genres']
# 
# mov = pd.read_table('ratings.dat', sep='::', header=None, names=mnames)
# mov[:10]
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('movies.dat', sep='::', header=None, names=mnames)

C:\Users\ASIF_PC\Anaconda3\lib\site-packages\ipykernel_launcher.py:6: FutureWarning: read_table is deprecated, use read_csv instead.

C:\Users\ASIF_PC\Anaconda3\lib\site-packages\ipykernel_launcher.py:6: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

In [41]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [64]:
all_gen=[]
for x in movies.genres:
    all_gen.extend(x.split('|'))#list object has no attribute append!
    
unique_gen=pd.unique(all_gen)
unique_gen

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [71]:
zero_matrix = np.zeros((len(movies), len(unique_gen)))
zero_matrix.shape

(3883, 18)

In [58]:
dummies = pd.DataFrame(zero_matrix, columns=unique_gen)
dummies[:6]

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
5,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [94]:
gen = movies.genres[0]
print(gen.split('|'))
display( dummies.columns.get_indexer(gen.split('|')))

['Animation', "Children's", 'Comedy']

array([0, 1, 2], dtype=int64)

In [91]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [92]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [82]:
#--------------------
# Python program to illustrate 
# enumerate function 
l1 = ["eat","sleep","repeat"] 
s1 = "geek"

# # creating enumerate objects 
obj1 = enumerate(l1) 
obj2 = enumerate(s1,2) 

# print("Return type:",type(obj1) )
# print( list(enumerate(l1)) )

# # changing start index to 2 from 0 
# print (list(enumerate(s1,2))) 
list(obj1)
list(obj2)

[(2, 'g'), (3, 'e'), (4, 'e'), (5, 'k')]

In [101]:
#split===>from which seperator? 

text='Toy  Story  (1995)Animation Childrens      Comedy'
print(text.split(' '))

['Toy', '', 'Story', '', '(1995)Animation', 'Childrens', '', '', '', '', '', 'Comedy']

In [99]:
print(text.strip())

Toy  Story  (1995)Animation Childrens      Comedy

In [98]:
pieces = [x.strip() for x in text.split(" ")]
print(pieces)

['Toy', '', 'Story', '', '(1995)Animation', 'Childrens', '', '', '', '', '', 'Comedy']

In [60]:
print(text.split(' '))

['Toy', '', 'Story', '', '(1995)Animation', 'Childrens', '', '', '', '', '', 'Comedy']

In [61]:
text2='Toy  Story  (1995)Animation Childrens      Comedy and tuber fejrfberfje ejfe bfjke fje fejf '
o=[x.strip() for x in text2.split()]
print(o)

['Toy', 'Story', '(1995)Animation', 'Childrens', 'Comedy', 'and', 'tuber', 'fejrfberfje', 'ejfe', 'bfjke', 'fje', 'fejf']

In [62]:
o=' '.join(o)
print(o)

Toy Story (1995)Animation Childrens Comedy and tuber fejrfberfje ejfe bfjke fje fejf

In [70]:
text3='a,f,f, mdb'
text3.index(',')

1

In [74]:
text3.find(',')# Note the difference between find and index is that index raises an exception if the
# string isnt found

1

In [79]:
text3.replace(',','||')

'a||f||f|| mdb'